_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ИнвестиционныйНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ИнвестиционныйНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_НДСИнвестиционный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписанияНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НДСПоСМР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НДСПоТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВключениеВСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСтроительства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСписанияНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_УчетнаяПолитикаПоДолевомуСтроительству</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаИнвестиционногоНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовПоСанкциям</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаНастроекФинУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаДоступаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьФЗ214</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспределениеНДСЕжемесячно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СпособыКорректировкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыКорректировкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Скорректировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокировать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ИнвестиционныйНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроверкиПередЗаполнением

// Функция проверяет наличие документов "Инвестиционный НДС" по заданным условиям и возвращает результат данной проверки.
//
Функция ПроверитьНаличиеДокументовИнвестиционныйНДСЗаПериод(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"		, НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода"	, КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ТекущийДокумент"		, Объект.Ссылка);
	Запрос.УстановитьПараметр("ОбъектСтроительства"	, Объект.ОбъектСтроительства);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИнвестиционныйНДС.Ссылка КАК ДокументПоОбъектуСтроительства
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС КАК ИнвестиционныйНДС
	               |ГДЕ
	               |	ИнвестиционныйНДС.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И НЕ ИнвестиционныйНДС.Ссылка = &ТекущийДокумент
	               |	И ИнвестиционныйНДС.ОбъектСтроительства = &ОбъектСтроительства
	               |	И ИнвестиционныйНДС.Проведен";
				   
	ДокументыСуществуют = Не Запрос.Выполнить().Пустой();
	Если ДокументыСуществуют Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='По выбранному объекту строительства за текущий месяц уже существуют документы ""Инвестиционный НДС""'"));
	КонецЕсли;
	
	Возврат ДокументыСуществуют;	
	
КонецФункции // ПроверитьНаличиеДокументовИнвестиционныйНДСЗаПериод()

// Функция проверяет наличие документов "Закрытие объекта строительства" по заданным условиям и возвращает результат данной проверки.
//
Функция ПроверитьНаличиеДокументовЗакрытиеОбъектаСтроительстваЗаПериод(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"		, НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода"	, КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ОбъектСтроительства"	, Объект.ОбъектСтроительства);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗакрытиеОбъектаСтроительства.Ссылка КАК ДокументПоОбъектуСтроительства
	               |ИЗ
	               |	Документ.УСОERP_ЗакрытиеОбъектаСтроительства КАК ЗакрытиеОбъектаСтроительства
	               |ГДЕ
	               |	ЗакрытиеОбъектаСтроительства.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И ЗакрытиеОбъектаСтроительства.ОбъектСтроительства = &ОбъектСтроительства
	               |	И ЗакрытиеОбъектаСтроительства.Проведен";
				   
	ДокументыСуществуют = Не Запрос.Выполнить().Пустой();
	Если ДокументыСуществуют Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='По выбранному объекту строительства за текущий месяц уже существуют документы ""Закрытие объекта строительства""'"));
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УСОERP_СдачаОбъектаНедвижимости.Ссылка КАК ДокументПоОбъектуСтроительства
	               |ИЗ
	               |	Документ.УСОERP_СдачаОбъектаНедвижимости КАК УСОERP_СдачаОбъектаНедвижимости
	               |ГДЕ
	               |	УСОERP_СдачаОбъектаНедвижимости.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	               |	И УСОERP_СдачаОбъектаНедвижимости.ОбъектСтроительства = &ОбъектСтроительства
	               |	И УСОERP_СдачаОбъектаНедвижимости.Проведен";
				   
	ДокументыСуществуют = Не Запрос.Выполнить().Пустой();
	Если ДокументыСуществуют Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='По выбранному объекту строительства за текущий месяц уже существуют документы ""Сдача объекта недвижимости в эксплуатацию""'"));
	КонецЕсли;

	
	Возврат ДокументыСуществуют;	
	
КонецФункции // ПроверитьНаличиеДокументовЗакрытиеОбъектаСтроительстваЗаПериод()

// Функция проверяет проведение текущего документа перед его заполнением и возвращает результат данной проверки.
//
Функция ПроверитьПроведениеТекущегоДокументаПередЗаполнением(Объект) Экспорт
	
	ДокументПроведен = Объект.Проведен;
	Если ДокументПроведен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Заполнение доступно только для непроведенного документа, сначала необходимо отменить проведение'"));
	КонецЕсли;
	
	Возврат ДокументПроведен;	
	
КонецФункции // ПроверитьПроведениеТекущегоДокументаПередЗаполнением()

#КонецОбласти

#Область ПроводкиРеглУчета

// Функция формирует и возвращает текст запроса для отражения документа в регламентированном учете.
//
Функция ТекстОтраженияВРеглУчете() Экспорт

	НакоплениеНДСПоРаботамУслугам = " 
	|ВЫБРАТЬ //// Накопление НДС по работам/услугам (Дт 19.ХХ :: Кт 19.ХХ)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаНДС КАК Сумма,
	
	|	Строки.СуммаНДС КАК СуммаУУ,

	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	УчетнаяПолитика.СчетУчетаИнвестиционногоНДС КАК СчетДт,
	|
	|	Строки.Контрагент КАК СубконтоДт1,
	|	Строки.ДокументПоступления КАК СубконтоДт2,
	|	Строки.ОбъектСтроительства КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	Строки.СчетУчетаНДС КАК СчетКт,
	|
	|	Строки.Контрагент КАК СубконтоКт1,
	|	Строки.ДокументПоступления КАК СубконтоКт2,
	|	Строки.ОбъектСтроительства КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Накопление НДС по работам/услугам"" КАК Содержание
	|
	|ИЗ
	|	Документ.УСОERP_ИнвестиционныйНДС КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ИнвестиционныйНДС.НДСПоСМР КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&Дата, ) КАК УчетнаяПолитика
	|		ПО Операция.Организация = УчетнаяПолитика.Организация
	|ГДЕ
	|	Операция.Ссылка = &Ссылка";
	
	НакоплениеНДСПоМатериалам = "
	|ВЫБРАТЬ //// Накопление НДС по материалам (Дт 19.ХХ :: Кт 19.ХХ)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаНДС КАК Сумма,
	
	|	Строки.СуммаНДС КАК СуммаУУ,
	
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	УчетнаяПолитика.СчетУчетаИнвестиционногоНДС КАК СчетДт,
	|
	|	Строки.Контрагент КАК СубконтоДт1,
	|	Строки.ДокументПоступления КАК СубконтоДт2,
	|	Строки.ОбъектСтроительства КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	Строки.СчетУчетаНДС КАК СчетКт,
	|
	|	Строки.Контрагент КАК СубконтоКт1,
	|	Строки.ДокументПоступления КАК СубконтоКт2,
	|	Строки.ОбъектСтроительства КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Накопление НДС по материалам"" КАК Содержание
	|
	|ИЗ
	|	Документ.УСОERP_ИнвестиционныйНДС КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ИнвестиционныйНДС.НДСПоТМЦ КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&Дата, ) КАК УчетнаяПолитика
	|		ПО Операция.Организация = УчетнаяПолитика.Организация
	|ГДЕ
	|	Операция.Ссылка = &Ссылка";
	
	ВключениеНДСВСтоимость = "
	|ВЫБРАТЬ //// Включение НДС в стоимость объекта (Дт 08.ХХ :: Кт 19.ХХ)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	Строки.СуммаНДС КАК Сумма,
	
	|	Строки.СуммаНДС КАК СуммаУУ,
	
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|	Строки.СчетСписанияНДС КАК СчетДт,
	|
	|	Строки.ОбъектСтроительства КАК СубконтоДт1,
	|	Строки.Номенклатура КАК СубконтоДт2,
	|	Строки.СпособСтроительства КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаНДС КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	УчетнаяПолитика.СчетУчетаИнвестиционногоНДС КАК СчетКт,
	|
	|	Строки.Контрагент КАК СубконтоКт1,
	|	Строки.ДокументПоступления КАК СубконтоКт2,
	|	Строки.ОбъектСтроительства КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Включение НДС в стоимость объекта"" КАК Содержание
	|
	|ИЗ
	|	Документ.УСОERP_ИнвестиционныйНДС КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УСОERP_ИнвестиционныйНДС.ВключениеВСтоимость КАК Строки
	|		ПО (Строки.Ссылка = Операция.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&Дата, ) КАК УчетнаяПолитика
	|		ПО Операция.Организация = УчетнаяПолитика.Организация
	|ГДЕ
	|	Операция.Ссылка = &Ссылка";
	
	Возврат НакоплениеНДСПоРаботамУслугам
	+ " ОБЪЕДИНИТЬ ВСЕ " + НакоплениеНДСПоМатериалам
	+ " ОБЪЕДИНИТЬ ВСЕ " + ВключениеНДСВСтоимость;

КонецФункции // ТекстОтраженияВРеглУчете()

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламетированном учете
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	ТекстЗапроса = "";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Проведение

// Процедура инициализирует данные документа для их последующего отражения в связанных с документом регистрах.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДокумента.Дата КАК Период,
	               |	ДанныеДокумента.Организация КАК Организация
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.Ссылка = &ТекущийДокумент";
				   
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период"		, Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация"	, Реквизиты.Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаНДСИнвестиционныйПоСМР.НомерСтроки КАК НомерСтроки,
	               |	&Период КАК Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Организация КАК Организация,
	               |	ТаблицаНДСИнвестиционныйПоСМР.Контрагент КАК Контрагент,
	               |	ТаблицаНДСИнвестиционныйПоСМР.ДокументПоступления КАК ДокументПоступления,
	               |	ТаблицаНДСИнвестиционныйПоСМР.ОбъектСтроительства КАК ОбъектСтроительства,
	               |	УСОERP_УчетнаяПолитикаПоДолевомуСтроительствуСрезПоследних.СчетУчетаИнвестиционногоНДС КАК СчетУчетаНДС,
	               |	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	               |	ТаблицаНДСИнвестиционныйПоСМР.СпособСтроительства КАК СпособСтроительства,
	               |	ТаблицаНДСИнвестиционныйПоСМР.СуммаБезНДС КАК СуммаБезНДС,
	               |	ТаблицаНДСИнвестиционныйПоСМР.СуммаНДС КАК СуммаНДС
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС.НДСПоСМР КАК ТаблицаНДСИнвестиционныйПоСМР
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&Период, ) КАК УСОERP_УчетнаяПолитикаПоДолевомуСтроительствуСрезПоследних
	               |		ПО ТаблицаНДСИнвестиционныйПоСМР.Ссылка.Организация = УСОERP_УчетнаяПолитикаПоДолевомуСтроительствуСрезПоследних.Организация
	               |ГДЕ
	               |	ТаблицаНДСИнвестиционныйПоСМР.Ссылка = &ТекущийДокумент
	               |	И (ТаблицаНДСИнвестиционныйПоСМР.СуммаБезНДС <> 0
	               |			ИЛИ ТаблицаНДСИнвестиционныйПоСМР.СуммаНДС <> 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.НомерСтроки,
	               |	&Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	               |	&Организация,
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.Контрагент,
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.ДокументПоступления,
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.ОбъектСтроительства,
	               |	УСОERP_УчетнаяПолитикаПоДолевомуСтроительствуСрезПоследних.СчетУчетаИнвестиционногоНДС,
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.Номенклатура,
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.СпособСтроительства,
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.СуммаБезНДС,
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.СуммаНДС
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС.НДСПоТМЦ КАК ТаблицаНДСИнвестиционныйПоТМЦ,
	               |	РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&Период, ) КАК УСОERP_УчетнаяПолитикаПоДолевомуСтроительствуСрезПоследних
	               |ГДЕ
	               |	ТаблицаНДСИнвестиционныйПоТМЦ.Ссылка = &ТекущийДокумент
	               |	И (ТаблицаНДСИнвестиционныйПоТМЦ.СуммаБезНДС <> 0
	               |			ИЛИ ТаблицаНДСИнвестиционныйПоТМЦ.СуммаНДС <> 0)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.НомерСтроки,
	               |	&Период,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	               |	&Организация,
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.Контрагент,
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.ДокументПоступления,
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.ОбъектСтроительства,
	               |	УСОERP_УчетнаяПолитикаПоДолевомуСтроительствуСрезПоследних.СчетУчетаИнвестиционногоНДС,
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.Номенклатура,
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.СпособСтроительства,
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.СуммаБезНДС,
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.СуммаНДС
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС.ВключениеВСтоимость КАК ТаблицаНДСИнвестиционныйВключениеВСтоимость,
	               |	РегистрСведений.УСОERP_УчетнаяПолитикаПоДолевомуСтроительству.СрезПоследних(&Период, ) КАК УСОERP_УчетнаяПолитикаПоДолевомуСтроительствуСрезПоследних
	               |ГДЕ
	               |	ТаблицаНДСИнвестиционныйВключениеВСтоимость.Ссылка = &ТекущийДокумент
	               |	И (ТаблицаНДСИнвестиционныйВключениеВСтоимость.СуммаБезНДС <> 0
	               |			ИЛИ ТаблицаНДСИнвестиционныйВключениеВСтоимость.СуммаНДС <> 0)";

	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаНДСИнвестиционный", Результат[0].Выгрузить());

КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область Отчеты
	// Определяет список команд отчетов.
	//
	// Параметры:
	//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
	//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
	//   Параметры - Структура - Вспомогательные параметры. Для чтения.
	//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
	//
	Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
		
		ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
	КонецПроцедуры
	
#КонецОбласти 


#Область СозданиеНаОсновании
// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт

	  Документы.ЗаписьКнигиПокупок.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	  
КонецПроцедуры

#КонецОбласти


#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#Область СторнированиеДокументов

// Процедура формирует сторнирующие документы "Запись книги покупок" по данным регистра накопления "НДС Покупки".
//
Процедура СформироватьСторнирующиеДокументыЗаписьКнигиПокупок(ДокументСсылка, Отказ) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"	 , НачалоМесяца(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода" , КонецМесяца(ДокументСсылка.Дата));
	Запрос.УстановитьПараметр("ТекущийДокумент"	 , ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НакоплениеНДСПоРаботамУслугам.ДокументПоступления КАК СчетФактура,
	               |	НакоплениеНДСПоРаботамУслугам.СчетУчетаНДС КАК СчетУчетаНДС
	               |ПОМЕСТИТЬ ВТНакопленияИнвестиционныхНДСПоТаблицам
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС.НДСПоСМР КАК НакоплениеНДСПоРаботамУслугам
	               |ГДЕ
	               |	НакоплениеНДСПоРаботамУслугам.Ссылка = &ТекущийДокумент
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НакоплениеНДСПоМатериалам.ДокументПоступления,
	               |	НакоплениеНДСПоМатериалам.СчетУчетаНДС
	               |ИЗ
	               |	Документ.УСОERP_ИнвестиционныйНДС.НДСПоТМЦ КАК НакоплениеНДСПоМатериалам
	               |ГДЕ
	               |	НакоплениеНДСПоМатериалам.Ссылка = &ТекущийДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТНакопленияИнвестиционныхНДСПоТаблицам.СчетФактура КАК СчетФактура,
	               |	ВТНакопленияИнвестиционныхНДСПоТаблицам.СчетУчетаНДС КАК СчетУчетаНДС
	               |ПОМЕСТИТЬ ВТНакопленияИнвестиционныхНДС
	               |ИЗ
	               |	ВТНакопленияИнвестиционныхНДСПоТаблицам КАК ВТНакопленияИнвестиционныхНДСПоТаблицам
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СчетФактура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТНакопленияИнвестиционныхНДС.СчетФактура КАК ДокументРасчетов,
	               |	ВТНакопленияИнвестиционныхНДС.СчетУчетаНДС КАК СчетУчетаНДС,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.ДатаСобытия, НЕОПРЕДЕЛЕНО) КАК Дата,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.Организация, НЕОПРЕДЕЛЕНО) КАК Организация,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.Поставщик, НЕОПРЕДЕЛЕНО) КАК Контрагент,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.ЗаписьДополнительногоЛиста, НЕОПРЕДЕЛЕНО) КАК ЗаписьДополнительногоЛиста,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.КорректируемыйПериод, НЕОПРЕДЕЛЕНО) КАК КорректируемыйПериод,
	               |	ЕСТЬNULL(ВалютаРегламентированногоУчета.Значение, НЕОПРЕДЕЛЕНО) КАК Валюта,
	               |	ЗНАЧЕНИЕ(Перечисление.СпособыКорректировкиНДС.Скорректировать) КАК СпособКорректировкиНДС,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.ВидЦенности, НЕОПРЕДЕЛЕНО) КАК ВидЦенности,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.Событие, НЕОПРЕДЕЛЕНО) КАК Событие,
	               |	ЕСТЬNULL(НДСЗаписиКнигиПокупок.СтавкаНДС, НЕОПРЕДЕЛЕНО) КАК СтавкаНДС,
	               |	ЕСТЬNULL(-НДСЗаписиКнигиПокупок.СуммаБезНДСОборот, 0) КАК Сумма,
	               |	ЕСТЬNULL(-НДСЗаписиКнигиПокупок.НДСОборот, 0) КАК СуммаНДС
	               |ИЗ
	               |	ВТНакопленияИнвестиционныхНДС КАК ВТНакопленияИнвестиционныхНДС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	               |				&НачалоПериода,
	               |				&ОкончаниеПериода,
	               |				,
	               |				СчетФактура В
	               |					(ВЫБРАТЬ
	               |						ВТНакопленияИнвестиционныхНДС.СчетФактура
	               |					ИЗ
	               |						ВТНакопленияИнвестиционныхНДС)) КАК НДСЗаписиКнигиПокупок
	               |		ПО ВТНакопленияИнвестиционныхНДС.СчетФактура = НДСЗаписиКнигиПокупок.СчетФактура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	(НЕ НДСЗаписиКнигиПокупок.СуммаБезНДСОборот = 0
	               |			ИЛИ НЕ НДСЗаписиКнигиПокупок.НДСОборот = 0)";
	
	ТаблицаСторнирования = Запрос.Выполнить().Выгрузить();
	
	РеквизитыШапкиДокумента	= "ДокументРасчетов, СчетУчетаНДС, Дата, Организация, Контрагент, ЗаписьДополнительногоЛиста, КорректируемыйПериод, Валюта, СпособКорректировкиНДС";
	ТаблицаДокументов		= ТаблицаСторнирования.Скопировать();
	ТаблицаДокументов.Свернуть(РеквизитыШапкиДокумента);
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		
		СообщениеОбОшибке	= НСтр("ru='Не удалось создать сторнирующий документ для документа """ + Строка(СтрокаТаблицы.ДокументРасчетов) + """ по причине:'");
		СтруктураРеквизитов = Новый Структура(РеквизитыШапкиДокумента);
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, СтрокаТаблицы);
		
		СторнирующийДокумент = Документы.ЗаписьКнигиПокупок.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(СторнирующийДокумент, СтруктураРеквизитов);
		
		СтрокиДокумента = ТаблицаСторнирования.НайтиСтроки(СтруктураРеквизитов);
		Для Каждого СтрокаДокумента Из СтрокиДокумента Цикл
			ЗаполнитьЗначенияСвойств(СторнирующийДокумент.Ценности.Добавить(), СтрокаДокумента);
		КонецЦикла;
		
		Попытка
			СторнирующийДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), , , , Отказ);
		КонецПопытки;
		
		Если СторнирующийДокумент.Проведен Тогда
			ОтразитьЗаписьКнигиПокупокВРегламентированномУчете(СторнирующийДокумент.Ссылка, СтрокаТаблицы.ДокументРасчетов, СтрокаТаблицы.СчетУчетаНДС);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьСторнирующиеДокументыЗаписьКнигиПокупок()

// Процедура отражает сформированный и проведенный перед этим документ "Запись книги покупок" в регламентированном учете.
//
Процедура ОтразитьЗаписьКнигиПокупокВРегламентированномУчете(СторнирующийДокументСсылка, ДокументРасчетов, СчетУчетаНДС)
	
	ЗаполнитьРегистрПорядокОтраженияПрочихОпераций(СторнирующийДокументСсылка, ДокументРасчетов, СчетУчетаНДС);
	
	СтруктураРеквизиты = Новый Структура("Ссылка, Дата, Организация", СторнирующийДокументСсылка, СторнирующийДокументСсылка.Дата, СторнирующийДокументСсылка.Организация);
	РеглУчетПроведениеСервер.ОтразитьДокумент(СтруктураРеквизиты, Истина);
	
КонецПроцедуры // ОтразитьЗаписьКнигиПокупокВРегламентированномУчете()

// Процедура заполняет регистр сведений "Порядок отражения прочих операций" необходимыми для проведения документа сведениями.
//
Процедура ЗаполнитьРегистрПорядокОтраженияПрочихОпераций(СторнирующийДокументСсылка, ДокументРасчетов, СчетУчетаНДС)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетУчетаНДС"	 	 , СчетУчетаНДС);
	Запрос.УстановитьПараметр("ДокументРасчетов"	 , ДокументРасчетов);
	Запрос.УстановитьПараметр("СторнирующийДокумент" , СторнирующийДокументСсылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаписьКнигиПокупокЦенности.Ссылка КАК Документ,
	               |	ЗаписьКнигиПокупокЦенности.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	&СчетУчетаНДС КАК СчетУчета,
	               |	ЗаписьКнигиПокупок.Организация КАК Организация,
	               |	ЗаписьКнигиПокупок.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТЦенностиЗаписиКнигиПокупок
	               |ИЗ
	               |	Документ.ЗаписьКнигиПокупок.Ценности КАК ЗаписьКнигиПокупокЦенности
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаписьКнигиПокупок КАК ЗаписьКнигиПокупок
	               |		ПО ЗаписьКнигиПокупокЦенности.Ссылка = ЗаписьКнигиПокупок.Ссылка
	               |ГДЕ
	               |	ЗаписьКнигиПокупокЦенности.Ссылка = &СторнирующийДокумент
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Организация,
	               |	СчетУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЦенностиЗаписиКнигиПокупок.Документ КАК Документ,
	               |	ВТЦенностиЗаписиКнигиПокупок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ВТЦенностиЗаписиКнигиПокупок.СчетУчета КАК СчетУчета,
	               |	ЕСТЬNULL(ХозрасчетныйДвиженияССубконто.СубконтоКт1, НЕОПРЕДЕЛЕНО) КАК Субконто1,
	               |	ЕСТЬNULL(ХозрасчетныйДвиженияССубконто.СубконтоКт2, НЕОПРЕДЕЛЕНО) КАК Субконто2,
	               |	ЕСТЬNULL(ХозрасчетныйДвиженияССубконто.СубконтоКт3, НЕОПРЕДЕЛЕНО) КАК Субконто3,
	               |	ВТЦенностиЗаписиКнигиПокупок.Организация КАК Организация,
	               |	ВТЦенностиЗаписиКнигиПокупок.Дата КАК Дата
	               |ИЗ
	               |	ВТЦенностиЗаписиКнигиПокупок КАК ВТЦенностиЗаписиКнигиПокупок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	               |				,
	               |				,
	               |				Регистратор В
	               |						(ВЫБРАТЬ
	               |							СчетФактураПолученныйДокументыОснования.Ссылка
	               |						ИЗ
	               |							Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |						ГДЕ
	               |							СчетФактураПолученныйДокументыОснования.ДокументОснование = &ДокументРасчетов)
	               |					И СчетКт = &СчетУчетаНДС,
	               |				,
	               |				) КАК ХозрасчетныйДвиженияССубконто
	               |		ПО ВТЦенностиЗаписиКнигиПокупок.Организация = ХозрасчетныйДвиженияССубконто.Организация
	               |			И ВТЦенностиЗаписиКнигиПокупок.СчетУчета = ХозрасчетныйДвиженияССубконто.СчетКт";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписиРегистра = РегистрыСведений.ПорядокОтраженияПрочихОпераций.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписиРегистра.Документ			   = Выборка.Документ;
		МенеджерЗаписиРегистра.ИдентификаторСтроки = Выборка.ИдентификаторСтроки;
		МенеджерЗаписиРегистра.Прочитать();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиРегистра, Выборка);
		МенеджерЗаписиРегистра.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРегистрПорядокОтраженияПрочихОпераций()

#КонецОбласти

#КонецЕсли
